// 2013-12-4.cpp : 定义控制台应用程序的入口点。
//
#include "stdafx.h"
#include <cstdio>
#include <iostream>
#include <string.h>
#include <math.h>
#include <vector>
#include <queue>
#include<iomanip>
#include <ctype.h>
#include <algorithm>
using namespace std;
int n;
int cnt;
int dp[1005][16];
int main()
{
    freopen("input.txt","r",stdin);
    freopen("output.txt","w",stdout);
	scanf("%d",&n);
	memset(dp,0,sizeof(dp));
	dp[1][2]=1;
	for(int i = 2;i<=n;i++)
	{
		for(int j = 0;j<16;j++)
		{
			if((j&1)&&(j&2)&&(j&4)&&(j&8))//全有 只能加1 3
			{
				dp[i][j] += (dp[i-1][j]+dp[i-1][j])%1000000007;
				dp[i][j] %=1000000007;
			}
			else if((!(j&1))&&(j&2)&&(j&4)&&(j&8))//只没有3 可以加1 2 3
			{
				dp[i][j] += (dp[i-1][j]+dp[i-1][j])%1000000007;//加1 2
				dp[i][j] %=1000000007;
				dp[i][j|1] += dp[i-1][j];//加3
				dp[i][j|1] %= 1000000007;
			}
			else if((j&1)&&(!(j&2))&&(j&4)&&(j&8))//只没有2 可以加1
			{
				dp[i][j] += dp[i-1][j];//加1
				dp[i][j] %= 1000000007;
			}
			else if((j&1)&&(j&2)&&(!(j&4))&&(j&8))//只没有1 可以加0 1 3
			{
				dp[i][j] += (dp[i-1][j]+dp[i-1][j])%1000000007;
				dp[i][j] %=1000000007;
				dp[i][j|4] += dp[i-1][j];//加1
				dp[i][j|4] %= 1000000007;
			}
			else if((j&1)&&(j&2)&&(j&4)&&(!(j&8)))//只没有0 可以加1 3
			{
				dp[i][j] += (dp[i-1][j]+dp[i-1][j])%1000000007;
				dp[i][j] %=1000000007;
			}
			else if((!(j&1))&&(!(j&2))&&(j&4)&&(j&8))//没有3 2 可以放1 2
			{
				dp[i][j] += (dp[i-1][j])%1000000007;
				dp[i][j] %=1000000007;
				dp[i][j|2] += dp[i-1][j];
				dp[i][j|2] %= 1000000007;
			}
			else if((!(j&1))&&(j&2)&&(!(j&4))&&(j&8))//没有3 1 可以放0 1 2 3
			{
				dp[i][j] += (dp[i-1][j]+dp[i-1][j])%1000000007;
				dp[i][j] %=1000000007;
				dp[i][j|1] += dp[i-1][j];
				dp[i][j|1] %= 1000000007;
				dp[i][j|4] += dp[i-1][j];
				dp[i][j|4] %= 1000000007;
			}
			else if((!(j&1))&&(j&2)&&(j&4)&&(!(j&8)))//没有3 0 可以放1 2 3
			{
				dp[i][j] += (dp[i-1][j]+dp[i-1][j])%1000000007;
				dp[i][j] %=1000000007;
				dp[i][j|1] += dp[i-1][j];//放3
				dp[i][j|1] %= 1000000007;
			}
			else if((j&1)&&(!(j&2))&&(!(j&4))&&(j&8))//没有2 1 可以放0 1 3
			{
				dp[i][j] += (dp[i-1][j]+dp[i-1][j])%1000000007;
				dp[i][j] %=1000000007;
				dp[i][j|4] += dp[i-1][j];//放1
				dp[i][j|4] %= 1000000007;
			}
			else if((j&1)&&(!(j&2))&&(j&4)&&(!(j&8)))//没有2 0 可以放1 3
			{
				dp[i][j] += (dp[i-1][j]+dp[i-1][j])%1000000007;
				dp[i][j] %=1000000007;
			}
			else if((j&1)&&(j&2)&&(!(j&4))&&(!(j&8)))//没有1 0 只能加0 3
			{
				dp[i][j] += (dp[i-1][j])%1000000007;
				dp[i][j] %=1000000007;
				dp[i][j|8] += dp[i-1][j];//加0
				dp[i][j|8] %= 1000000007;
			}
			else if((!(j&1))&&(!(j&2))&&(!(j&4))&&(j&8))//没有3 2 1 只能放0 1 2
			{
				dp[i][j] += (dp[i-1][j])%1000000007;
				dp[i][j] %=1000000007;
				dp[i][j|4] += dp[i-1][j];
				dp[i][j|4] %= 1000000007;
				dp[i][j|2] += dp[i-1][j];
				dp[i][j|2] %= 1000000007;
			}
			else if((!(j&1))&&(!(j&2))&&(j&4)&&(!(j&8)))//没有3 2 0 只能放1 2
			{
				dp[i][j] += (dp[i-1][j])%1000000007;
				dp[i][j] %=1000000007;
				dp[i][j|2] += dp[i-1][j];
				dp[i][j|2] %= 1000000007;
			}
			else if((j&1)&&(!(j&2))&&(!(j&4))&&(!(j&8)))//没有0 1 2 可以放1 3
			{
				dp[i][j] += (dp[i-1][j])%1000000007;
				dp[i][j] %=1000000007;
				dp[i][j|4] += dp[i-1][j];
				dp[i][j|4] %= 1000000007;
			}
			else if((!(j&1))&&(j&2)&&(!(j&4))&&(!(j&8)))//没有0 1 3 可以放0 2 3
			{
				dp[i][j] += (dp[i-1][j])%1000000007;
				dp[i][j] %=1000000007;
				dp[i][j|8] += dp[i-1][j];
				dp[i][j|8] %= 1000000007;
				dp[i][j|1] += dp[i-1][j];
				dp[i][j|1] %= 1000000007;
			}
			else//全没有 只能放0 2
			{
				dp[i][j|8] += dp[i-1][j];
				dp[i][j|8] %= 1000000007;
				dp[i][j|2] += dp[i-1][j];
				dp[i][j|2] %= 1000000007;
			}
		}
	}
	printf("%d\n",dp[n][15]);
}

